app/views/dashboard/index.html.erb

SELECT COUNT(*) FROM `users`
---
 	<td>:</td>
 	<td><h5><%= User.count%></h5></td>